import { Injectable } from '@nestjs/common';

@Injectable()
export class AppService {
  serverRunInfo(): string {
    return 'Server is running!';
  }
}



// Ключевые компоненты
// Импорты:

// Декоратор Injectable импортируется из @nestjs/common. Этот декоратор отмечает класс как поставщик, который может быть внедрен в другие компоненты, такие как контроллеры или другие службы.
// Определение службы:

// Класс AppService декорирован декоратором @Injectable(), что делает его доступным для внедрения зависимостей в приложении NestJS. Это позволяет другим классам, таким как контроллеры, использовать эту службу без необходимости создавать ее экземпляр напрямую.
// Метод:

// Метод serverRunInfo() определен в классе AppService. Этот метод возвращает простую строку: «Сервер запущен!».
// Этот метод может быть вызван другими компонентами (например, контроллерами) для получения информации о состоянии сервера.
// Резюме
// Вкратце, класс AppService — это простая служба, которая предоставляет метод для проверки состояния работы сервера. Он разработан для внедрения в другие части приложения, такие как контроллеры, чтобы приложение оставалось модульным и удобным для обслуживания.

// В будущем эта служба может быть расширена для включения более сложной бизнес-логики или дополнительных методов по мере роста приложения. На данный момент она служит своей цели — предоставлению базового сообщения о состоянии, которое может быть полезно для проверки работоспособности или первоначальных ответов на входящие запросы.